[
  {
    "id": "workhive",
    "name": "WorkHive",
    "thumbnail": "/WorkHive/tamnail.png",
    "description": "A smart project monitoring system for managing tasks, tracking progress, and improving team collaboration.",
    "fullDescription": "WorkHive is a web-based project monitoring and collaboration system designed to help teams efficiently manage projects, assign tasks, track issues, and communicate in real time. It includes features like user authentication, project creation, team invitations, issue tracking, progress visualization, and an integrated chat system. The system ensures transparency, accountability, and productivity throughout the project lifecycle.",
    "purpose": "To enhance my full-stack development skills by learning Spring Boot for backend, React.js for frontend, and database integration.",
    "keyFeatures": [
      "Project Creation & Management – Easily create and manage projects",
      "User Invitation System – Add team members to collaborate on projects",
      "Issue Tracking & Resolution – Assign and resolve project issues efficiently",
      "Comment System – Improve teamwork with feedback and discussions",
      "Real-time Chat – Communicate with team members seamlessly",
      "Progress Tracking – Monitor project milestones and completion status",
      "Search & Filter – Advanced search and filtering options",
      "Responsive Design – Works seamlessly on all devices"
    ],
    "stack": {
      "Frontend": [
        "React",
        "Vite",
        "TailwindCSS",
        "ShadcnUI",
        "Redux",
        "React Router"
      ],
      "Backend": [
        "Java",
        "Spring Boot",
        "REST API",
        "JWT Authentication",
        "Security"
      ],
      "Database": ["MySQL"],
      "Deployment": ["Vercel", "Koyeb"],
      "Others": ["Stripe"]
    },
    "frontendUrl": "https://github.com/niloychandrasarker/Workhive-Frontend",
    "backendUrl": "https://github.com/niloychandrasarker/Workhive-Backend",
    "liveUrl": "",
    "projectType": "Solo",
    "status": "Completed",
    "role": "Full Stack Developer",
    "teamSize": 1,
    "technologies": "React, Spring Boot, MySQL, Redux, JWT",
    "gallery": [
      "/WorkHive/2.png",
      "/WorkHive/3.png",
      "/WorkHive/4.png",
      "/WorkHive/5.png",
      "/WorkHive/6.png",
      "/WorkHive/7.png",
      "/WorkHive/8.png",
      "/WorkHive/9.png"
    ]
  },
  {
    "id": "ecommerce",
    "name": "Ecommerce Multivendor",
    "thumbnail": "/Ecommerce Multivendor/tamnail.png",
    "description": "A multi-vendor ecommerce platform built to practice full-stack development with Spring Boot and React, featuring role-based user management and product operations.",
    "fullDescription": "Ecommerce Multivendor is a learning-focused full-stack ecommerce project designed to explore real-world development using Spring Boot and React. The system implements role-based access control for Admins, Vendors, and Customers, allowing vendors to manage their own products, handle orders, and track sales, while customers can browse and purchase products seamlessly. The project includes features such as product management, order tracking, secure authentication using JWT, and responsive UI built with React and Tailwind CSS. On the backend, Spring Boot handles REST APIs, authentication, and data persistence with MySQL, supported by Redis caching for performance optimization.",
    "purpose": "The main purpose of this project is to strengthen backend development skills with Spring Boot, understand and implement role-based user management, and improve frontend development skills using React.js by building a practical multi-vendor ecommerce platform.",
    "keyFeatures": [
      "Multi-vendor Support – Multiple sellers can manage their own stores",
      "Role-based Access Control – Separate dashboards for Admin, Vendor, and Customer",
      "Product Management – Vendors can add, edit, and manage products",
      "Order Tracking – Real-time order status updates for customers",
      "Secure Authentication – JWT-based authentication system",
      "Payment Integration – Secure checkout and payment processing",
      "Analytics Dashboard – Sales and performance tracking for vendors",
      "Responsive Design – Optimized for mobile and desktop devices"
    ],
    "stack": {
      "Frontend": ["React", "TailwindCSS", "Material UI", "React Router"],
      "Backend": [
        "Java",
        "Spring Boot",
        "REST API",
        "JWT Authentication",
        "Security"
      ],
      "Database": ["MySQL"],
      "Others": ["Stripe"]
    },
    "frontendUrl": "https://github.com/niloychandrasarker/Vendora-Ecommerce-Frontend",
    "backendUrl": "https://github.com/niloychandrasarker/Vendora-Ecommerce-Backend",
    "liveUrl": "",
    "projectType": "Solo",
    "status": "Ongoing",
    "role": "Full Stack Developer",
    "teamSize": 1,
    "technologies": "React, Spring Boot, MySQL, Redux, Stripe",
    "gallery": []
  },
  {
    "id": "rabitlog",
    "name": "RabitLog - A Blogging Platform",
    "thumbnail": "/Rabitlog/Tamnail.png",
    "description": "A full-stack  blog website with rich text editor, image uploads, user authentication via Clerk, and admin controls for featured posts and content moderation.",
    "fullDescription": "RabitLog is a modern personal blogging platform built with React, Node.js, Express, and MongoDB. The platform allows users to create and publish blog posts with images using React Quill rich text editor. Images are managed through ImageKit for optimized storage and delivery. User authentication is handled by Clerk, providing secure login and user management. The platform includes admin functionality where admins can mark posts as featured and have the ability to delete any post for content moderation.",
    "purpose": "To build a feature-rich personal blogging platform demonstrating full-stack development skills with MERN stack, third-party integrations (Clerk, ImageKit), rich text editing, and role-based admin access control.",
    "keyFeatures": [
      "User Authentication – Secure login and user management with Clerk",
      "Rich Text Editor – Create formatted blog posts using React Quill editor",
      "Image Upload – Upload and manage blog images with ImageKit integration",
      "Blog Post Management – Users can create, edit, and publish their own posts",
      "Featured Posts – Admin can mark specific posts as featured for homepage display",
      "Admin Controls – Admin ability to delete any post",
      "Responsive Design – Fully optimized for desktop, tablet, and mobile devices",
      "Image Optimization – Automatic image compression and CDN delivery via ImageKit",
      "User Profiles – Each user has their own profile with published posts"
    ],
    "stack": {
      "Frontend": ["React", "React Quill", "TailwindCSS"],
      "Backend": ["Node.js", "Express", "REST API"],
      "Database": ["MongoDB", "MongoDB Atlas"],
      "Others": ["Clerk Authentication", "ImageKit", "Vercel"]
    },
    "frontendUrl": "https://github.com/niloychandrasarker/Rabitlog-frontend",
    "backendUrl": "https://github.com/niloychandrasarker/Rabitlog-backend",
    "liveUrl": "https://rabitlog.vercel.app/",
    "projectType": "Solo",
    "status": "Completed",
    "role": "Full Stack Developer",
    "teamSize": 1,
    "technologies": "React, Node.js, Express, MongoDB, Clerk, ImageKit",
    "gallery": [
      "/Rabitlog/1.png",
      "/Rabitlog/2.png",
      "/Rabitlog/3.png",
      "/Rabitlog/4.png",
      "/Rabitlog/5.png",
      "/Rabitlog/6.png",
      "/Rabitlog/7.png",
      "/Rabitlog/8.png",
      "/Rabitlog/9.png"
    ]
  },
  {
    "id": "civicportal",
    "name": "CivicPortal - Multipurpose Civic Support Portal",
    "thumbnail": "/CivicPortal/tamnail.png",
    "description": "A modern and complete citizen service portal designed for government service delivery, transparency, and civic support with features like GD filing, case tracking, AI legal chatbot, and emergency support.",
    "fullDescription": "CivicPortal is a comprehensive multipurpose civic support platform that provides a complete digital solution for citizens to access government services, legal assistance, emergency services, and government transparency features. The platform includes GD filing, case tracking, fine payment, AI-powered legal chatbot, OpenGovt transparency dashboard, issue reporting & tracking, emergency support system, personal dashboard, and admin management panel.",
    "purpose": "To digitalize citizen services, increase government transparency, provide easy access to legal assistance, enable quick access to emergency services, and streamline citizen complaint management while empowering both citizens and government with an efficient, transparent, and accessible digital platform.",
    "keyFeatures": [
      "GD Filing System – Online General Diary filing with document upload, automatic receipt generation, and progress tracking",
      "Case Tracking – Real-time case updates, hearing date tracking, document management, and SMS/Email notifications",
      "Fine Payment – Online payment system with mobile banking/card support, payment history, digital receipts, and outstanding balance tracking",
      "AI Legal Chatbot – 24/7 legal consultation with Bengali language support covering family law, criminal law, civil law, labor law, and document templates",
      "OpenGovt Lens – Real-time budget information, project tracking, officer performance evaluation, public meetings, tender information, and audit reports for complete government transparency",
      "Issue Reporting & Tracking – Report civic issues with photo/video attachments, geolocation tagging, voting system for prioritization, and solution tracking",
      "Emergency Support – SOS button for immediate help, emergency contacts directory, hospital finder, police station locator, and fire service access",
      "Personal Dashboard – Complete profile management, service history, notification center, and digital document storage",
      "Admin Dashboard – User management, issue management, statistics & reports, and system monitoring for efficient administration",
      "Responsive Design – PWA-ready, offline support, dark/light mode, and mobile-first approach optimized for all devices"
    ],
    "stack": {
      "Frontend": ["React", "React Router DOM", "TailwindCSS", "Vite"]
    },
    "frontendUrl": "https://github.com/niloychandrasarker/Multipurpose-Civic-Support-Portal",
    "backendUrl": "https://multipurpose-civic-support-portal.vercel.app/",
    "liveUrl": "",
    "projectType": "Team",
    "status": "Ongoing",
    "role": "Frontend Developer",
    "teamSize": 3,
    "technologies": "React, TailwindCSS, Vite, React Router",
    "gallery": [
      "/CivicPortal/1.png",
      "/CivicPortal/2.png",
      "/CivicPortal/3.png",
      "/CivicPortal/4.png",
      "/CivicPortal/5.png",
      "/CivicPortal/6.png",
      "/CivicPortal/7.png",
      "/CivicPortal/8.png",
      "/CivicPortal/9.png",
      "/CivicPortal/10.png",
      "/CivicPortal/11.png",
      "/CivicPortal/12.png",
      "/CivicPortal/13.png",
      "/CivicPortal/14.png",
      "/CivicPortal/15.png",
      "/CivicPortal/16.png",
      "/CivicPortal/17.png"
    ]
  },
  {
    "id": "fosoldut",
    "name": "Fosoldut - AI-Powered Farming Assistant",
    "thumbnail": "/Fosoldut/tamnail.png",
    "description": "An intelligent AI/ML-based farming assistant with trained models for crop recommendation, disease detection, soil analysis, fertilizer guidance, and weather-based farming suggestions through an interactive chatbot interface.",
    "fullDescription": "Fosoldut is an advanced AI-powered farming assistant that leverages machine learning models trained specifically for agricultural applications. The system uses AI/ML algorithms to analyze weather patterns, soil conditions, and crop health to provide intelligent recommendations. Farmers can interact with an AI chatbot that understands farming queries and provides personalized suggestions based on trained models. The platform includes crop disease detection using computer vision, soil analysis for crop suitability, fertilizer recommendation systems, weather-based planting advice, and real-time farming guidance through natural language processing.",
    "purpose": "To provide farmers with an intelligent AI assistant that uses trained machine learning models to analyze agricultural data, recommend suitable crops based on weather and soil conditions, detect crop diseases, suggest optimal fertilizers, and offer personalized farming guidance through an interactive chatbot interface.",
    "keyFeatures": [
      "AI Chatbot Assistant – Interact with trained AI models to get instant farming advice and suggestions",
      "Smart Crop Recommendation – ML models analyze weather and soil data to recommend optimal crops",
      "AI Disease Detection – Computer vision models trained to identify crop diseases from images",
      "Soil Analysis System – ML-based soil analysis to determine crop suitability and requirements",
      "Fertilizer Guidance – AI recommends optimal fertilizer types and quantities based on crop and soil",
      "Trained ML Models – Backend uses trained machine learning models for accurate predictions"
    ],
    "stack": {
      "Frontend": ["React", "TailwindCSS", "Jspdf", "React Router"],
      "Backend": ["Python", "FastAPI", "AI/ML"],
      "Database": ["PostgreSQL"],
      "Others": ["Trained ML Models", "Image Processing"]
    },
    "frontendUrl": "https://github.com/niloychandrasarker/Foshol-Doot",
    "backendUrl": "",
    "liveUrl": "https://foshol-doot-87qf.vercel.app/",
    "projectType": "Team",
    "status": "Completed",
    "role": "Full Stack Developer",
    "teamSize": 4,
    "technologies": "React, Python, FastAPI, ML Models, PostgreSQL",
    "gallery": [
      "/Fosoldut/1.png",
      "/Fosoldut/2.png",
      "/Fosoldut/3.png",
      "/Fosoldut/4.png",
      "/Fosoldut/5.png",
      "/Fosoldut/6.png",
      "/Fosoldut/7.png",
      "/Fosoldut/8.png",
      "/Fosoldut/9.png",
      "/Fosoldut/10.png",
      "/Fosoldut/11.png",
      "/Fosoldut/12.png",
      "/Fosoldut/13.png"
    ]
  },
  {
    "id": "kidora",
    "name": "Kidora - Kids Product E-commerce Platform",
    "thumbnail": "/Kidora/tamnail.png",
    "description": "A comprehensive full-stack e-commerce platform specialized for kids' products with dual interfaces for customers and sellers, featuring product management, order processing, and advanced admin controls.",
    "fullDescription": "Kidora is a professional full-stack e-commerce platform built with Spring Boot and React, specifically designed for buying and selling kids' products including toys, clothing, books, and educational materials. The platform features two distinct interfaces: a customer-facing storefront for browsing and purchasing products, and a powerful seller/admin dashboard for managing inventory, processing orders, and analyzing sales. With secure authentication, real-time order tracking, product reviews, and comprehensive analytics, Kidora provides a complete e-commerce solution for the children's products market.",
    "purpose": "To build a robust full-stack e-commerce platform that demonstrates proficiency in Spring Boot backend development, React frontend architecture, role-based access control, and real-world business logic implementation while providing a specialized marketplace for kids' products.",
    "keyFeatures": [
      "Dual Interface System – Separate customer storefront and seller/admin dashboard",
      "Product Management – Sellers can add, edit, delete, and categorize products with images",
      "Shopping Experience – Browse products, add to cart, wishlist, and secure checkout",
      "Order Management – Track orders from placement to delivery with status updates",
      "User Authentication – JWT-based secure login for customers, sellers, and admins",
      "Admin Dashboard – Complete control over products, orders, users, and sales analytics",
      "Advanced Search & Filters – Find products by category, age group, price range, and ratings",
      "Sales Analytics – Visual dashboards showing sales trends, popular products, and revenue",
      "Order Tracking – Real-time order status updates and delivery tracking",
      "Responsive Design – Fully optimized for desktop, tablet, and mobile devices",
      "Image Upload System – Multiple product images with preview functionality"
    ],
    "stack": {
      "Frontend": ["React", "TailwindCSS", "Material UI", "React Router"],
      "Backend": [
        "Java",
        "Spring Boot",
        "REST API",
        "JWT Authentication",
        "Spring Security"
      ],
      "Database": ["PostgreSQL"],
      "Others": ["Image Storage"]
    },
    "frontendUrl": "https://github.com/niloychandrasarker/Kidora-main",
    "backendUrl": "https://github.com/niloychandrasarker/kidora-backend",
    "liveUrl": "",
    "projectType": "Client Project",
    "status": "Completed",
    "role": "Full Stack Developer",
    "teamSize": 2,
    "technologies": "React, Spring Boot, PostgreSQL, JWT, Material UI",
    "gallery": [
      "/Kidora/1.png",
      "/Kidora/2.png",
      "/Kidora/3.png",
      "/Kidora/4.png",
      "/Kidora/5.png",
      "/Kidora/6.png",
      "/Kidora/7.png",
      "/Kidora/8.png",
      "/Kidora/9.png",
      "/Kidora/10.png",
      "/Kidora/11.png",
      "/Kidora/12.png",
      "/Kidora/13.png",
      "/Kidora/14.png",
      "/Kidora/15.png",
      "/Kidora/admin-1.png",
      "/Kidora/admin-2.png",
      "/Kidora/admin-3.png",
      "/Kidora/admin-4.png",
      "/Kidora/admin-5.png",
      "/Kidora/admin-6.png",
      "/Kidora/admin-7.png",
      "/Kidora/admin-8.png"
    ]
  },
  {
    "id": "niter-cover",
    "name": "NITER Cover Page Maker",
    "thumbnail": "/Niter Cover Page Macker/tamnail.png",
    "description": "An automated cover page and index generator specifically designed for NITER CSE students to create lab reports, assignments, and final covers with PDF and image export options.",
    "fullDescription": "NITER Cover Page Maker is a specialized web application built for CSE students at NITER to automatically generate professionally formatted cover pages and index pages for their academic work. The tool supports multiple document types including lab report covers, lab final covers, assignment covers, and index pages. Students can customize their documents with course details, student information, and export them as PDF or image formats for easy submission.",
    "purpose": "To provide NITER CSE students with a quick and easy solution for creating standardized, professionally formatted cover pages and index pages for lab reports, assignments, and final submissions, eliminating manual formatting work.",
    "keyFeatures": [
      "Multiple Document Types – Create lab report covers, lab final covers, assignment covers, and index pages",
      "CSE-Specific Templates – Pre-designed templates following NITER CSE department standards",
      "Auto-fill Student Info – Automatically populate student name, ID, batch, and section details",
      "Course Information – Add course name, code, semester, and instructor information",
      "Dual Export Options – Download as PDF or image format (PNG/JPG)",
      "Index Page Generator – Create formatted index pages for reports and assignments",
      "Real-time Preview – See live preview before downloading",
      "Mobile Responsive – Access and create documents from any device"
    ],
    "stack": {
      "Frontend": ["Html", "CSS", "JavaScript"],
      "Backend": [],
      "Database": [],
      "Others": ["jsPDF", "html2canvas"]
    },
    "frontendUrl": "https://github.com/niloychandrasarker/NITER-Cover-Page",
    "backendUrl": "",
    "liveUrl": "https://nitercoverpage.vercel.app/",
    "projectType": "Solo",
    "status": "Completed",
    "role": "Frontend Developer",
    "teamSize": 1,
    "technologies": "HTML, CSS, JavaScript, jsPDF, html2canvas",
    "gallery": [
      "/Niter Cover Page Macker/1.png",
      "/Niter Cover Page Macker/2.png",
      "/Niter Cover Page Macker/3.png",
      "/Niter Cover Page Macker/4.png",
      "/Niter Cover Page Macker/5.png",
      "/Niter Cover Page Macker/6.png",
      "/Niter Cover Page Macker/7.png",
      "/Niter Cover Page Macker/8.png"
    ]
  }
]
